* Pipex
** Steps
- [ ] Fork
- [ ] Check if infile can be read then open it
- [ ] Get the path in envp, split it.
- [ ] Redirect infile to stdin
- [ ] Try to launch cmd1 with every path (or check with access): it will run it and stop process if the path is correct
- [ ] Fork again
- [ ] Check if outfile can be written to then open it
- [ ] Do the same with cmd2 but res cmd1 in stdin
* Time spent
** IN PROGRESS Pipex
:PROPERTIES:
:COLUMNS:  %40ITEM(Task) %17EFFORT(Estimated Effort){:} %CLOCKSUM(Time spent)
:Effort_ALL: 0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 7:00 8:00 9:00 10:00 11:00 12:00 13:00 14:00 15:00 16:00 17:00 18:00 19:00 20:00 21:00 22:00 23:00 24:00 25:00 26:00 27:00 28:00 29:00 30:00 31:00 32:00 33:00 34:00 35:00 36:00 37:00 38:00 39:00 40:00 41:00 42:00 43:00 44:00 45:00 46:00 47:00 48:00 49:00 50:00 51:00 52:00 53:00 54:00 55:00 56:00 57:00 58:00 59:00 60:00 61:00 62:00 63:00 64:00 65:00 66:00 67:00 68:00 69:00 70:00 71:00 72:00 73:00 74:00 75:00 76:00 77:00 78:00 79:00 80:00 81:00 82:00 83:00 84:00 85:00 86:00 87:00 88:00 89:00 90:00 91:00 92:00 93:00 94:00 95:00 96:00 97:00 98:00 99:00 100:00
:Effort:   50:00
:END:
*** CODING pipex program
:LOGBOOK:
CLOCK: [2024-06-20 Thu 19:18]--[2024-06-20 Thu 19:38] =>  0:20
CLOCK: [2024-06-20 Thu 17:48]--[2024-06-20 Thu 18:57] =>  1:09
CLOCK: [2024-06-20 Thu 14:21]--[2024-06-20 Thu 14:57] =>  0:36
CLOCK: [2024-06-20 Thu 14:10]--[2024-06-20 Thu 14:12] =>  0:02
CLOCK: [2024-06-20 Thu 14:08]--[2024-06-20 Thu 14:10] =>  0:02
CLOCK: [2024-06-20 Thu 13:23]--[2024-06-20 Thu 13:57] =>  0:34
CLOCK: [2024-06-19 Wed 12:13]--[2024-06-19 Wed 14:14] =>  2:01
:END:
*** IN PROGRESS document, test, repo orga
:LOGBOOK:
CLOCK: [2024-06-20 Thu 18:57]--[2024-06-20 Thu 19:17] =>  0:20
CLOCK: [2024-06-19 Wed 11:24]--[2024-06-19 Wed 12:12] =>  0:48
CLOCK: [2024-06-18 Tue 18:12]--[2024-06-18 Tue 18:33] =>  0:21
CLOCK: [2024-06-18 Tue 12:01]--[2024-06-18 Tue 12:17] =>  0:16
CLOCK: [2024-06-17 Mon 15:08]--[2024-06-17 Mon 15:45] =>  0:37
:END:
